W9D2/first_routes_controllers/app/controllers/artworks_controller.rb

    def index
        shared_artworks = User.find(params[:user_id]).shared_artworks
        authored_artworks = User.find(params[:user_id]).artworks
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def update
        artwork = Artwork.find(params[:id])
        if artwork.update_attributes(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1 WHERE "artworks"."id" = $2  [["image_url", "im_classy.jpg"], ["id", 3]]