W9D2/first_routes_controllers/app/controllers/comments_controller.rb

  def index
    comments = Comment.all
    comments = comments.where(commenter_id: params[:user_id]) if params[:user_id]
    comments = comments.where(artwork_id: params[:artwork_id]) if params[:artwork_id]
---
SELECT "comments".* FROM "comments" WHERE "comments"."commenter_id" = $1  [["commenter_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("commenter_id", "artwork_id", "body") VALUES ($1, $2, $3) RETURNING "id"  [["commenter_id", 2], ["artwork_id", 1], ["body", "someone has a ego"]]