W9D2/first_routes_controllers/app/controllers/users_controller.rb

  def index
    if params[:username]
      users = User.where("username ILIKE '%#{params[:username]}%'")
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Bob_The_Sob"]]
SELECT "users".* FROM "users" WHERE (Bob_The_Sob)

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username") VALUES ($1) RETURNING "id"  [["username", "Wiston_Derpius"]]

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "Marylyn_Class_Classy"], ["id", 3]]