W10D4/RedditClone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE (1) LIMIT ?  [["LIMIT", 1]]
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = ?  [["post_id", 1]]
---
    <ul>
        <% Sub.all.each do |sub| %>
        <li><input type="checkbox" name="post[sub_ids][]" <%= "checked" if @post.sub_ids.include?(sub.id) %>