W10D4/RedditClone/app/views/posts/new.html.erb

  <ul>
      <% Sub.all.each do |sub| %>
      <li><input type="checkbox" name="post[sub_ids][]" <%= "checked" if @post.sub_ids.include?(sub.id) %> value="<%=sub.id%>" ><%= sub.title %></li>
---
SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "subs" WHERE "subs"."title" = ? AND "subs"."id" != ? LIMIT ?  [["title", "yarg"], ["id", 1], ["LIMIT", 1]]