W10D4/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "gerg"], ["url", ""], ["content", "dsfgdfjdfj"], ["author_id", 2], ["created_at", "2019-09-05 22:51:01.620508"], ["updated_at", "2019-09-05 22:51:01.620508"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "posts" SET "author_id" = ?, "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author_id", 5], ["title", "adjaljda"], ["content", "jkjklkasjljlk"], ["updated_at", "2019-09-05 23:19:34.740118"], ["id", 1]]
---
  def update
    @post = Post.find_by(params[:id])
    @post.author_id = current_user.id
    if @post.update(post_params)