W10D4/RedditClone/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "yarg"], ["description", "YARG"], ["moderator_id", 2], ["created_at", "2019-09-05 21:20:30.781648"], ["updated_at", "2019-09-05 21:20:30.781648"]]

  def update
    @sub = current_user.subs.find_by(id: params[:id])
    if @sub.update(sub_params)
---
UPDATE "subs" SET "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["description", "YARG!!!"], ["updated_at", "2019-09-05 21:35:50.769695"], ["id", 1]]