W14D3/bench_bnb/app/controllers/api/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Bee_Rad"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(username: user_params[:username]).try(:authenticate, user_params[:password])