W14D3/bench_bnb/app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save