W9D5/music_app/app/views/tracks/show.html.erb


<% album_name = Album.find(@track.album_id).title %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

<ul>
  <% @track.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 5]]