W9D1/first_routes_controllers/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "marylynclassyclass@gmail.com"], ["id", 3]]