W10D4/RedditClone/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "dfgjklsdfglkjsdfgf"], ["LIMIT", 1]]
---
  def self.find_by_credentials(name, password)
    user = User.find_by(name: name)