W9D3/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Fredfredburger"], ["updated_at", "2019-08-28 23:26:55.518841"], ["id", 4]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)