W9D5/music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "recording_type") VALUES ($1, $2, $3, $4) RETURNING "id"  [["band_id", 4], ["title", "ferp"], ["year", 1230], ["recording_type", "Studio"]]

  def update
    @album = Album.find(params[:id])
    if @album.update(album_params)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "recording_type" = $1, "band_id" = $2, "title" = $3 WHERE "albums"."id" = $4  [["recording_type", "Live"], ["band_id", 8], ["title", "tes"], ["id", 2]]

  def destroy
    album = Album.find(params[:id])
    album.delete
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]

  def show
    @album = Album.includes(:tracks).find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]