W9D5/music_app/app/controllers/bands_controller.rb

  def show
    @band = Band.includes(:albums).find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 10]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    band = Band.find(params[:id])
    band.destroy
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]