W9D5/music_app/app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["track_id", 5], ["body", "ha ha"], ["created_at", "2019-09-01 23:49:56.537597"], ["updated_at", "2019-09-01 23:49:56.537597"]]
---
  def create
    note = Note.new(note_params)
    note.track_id = params[:track_id]
    note.user_id = current_user.id
    note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]
---
  def destroy
    note = Note.find(params[:id])
    if note.user_id == current_user.id
      note.destroy