W9D5/music_app/app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "track_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["album_id", 2], ["title", "fer"], ["ord", 1], ["lyrics", ""], ["track_type", "Bonus"], ["created_at", "2019-09-01 22:39:23.620033"], ["updated_at", "2019-09-01 22:39:23.620033"]]
---
  def create
    @track = Track.new(track_params)
    if @track.save

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def show
    @track = Track.includes(notes: :user).find(params[:id])

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "la la lala, elmos world!"], ["updated_at", "2019-09-01 22:16:40.469231"], ["id", 1]]
---
  def update
    @track = Track.find(params[:id])
    if @track.update(track_params)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 4]]
---
  def destroy
    track = Track.find(params[:id])
    track.destroy