W9D5/music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "gWssPXyvzD0mSm_KmnQ9VQ"], ["updated_at", "2019-09-01 19:16:02.233227"], ["id", 1]]