W9D5/music_app/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
  <select name="album[band_id" id="band">
    <% Band.all.each do |band| %>