W9D5/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 3]]
---
  <h2>Tracks</h2>
  <% @album.tracks.each do |track| %>