W14D3/bench_bnb/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def current_user
    @user ||= User.find_by(session_token: session[:session_token])